; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p17---int100n150-m25---int100c110---s503---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 - fuellevel
)

(:init
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level18 level18)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level18 level19)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level18 level20)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level18 level21)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level18 level22)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level18 level23)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level18 level24)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level18 level25)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level18 level26)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level18 level27)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level18 level28)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level18 level29)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level18 level30)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level18 level31)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level18 level32)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level18 level33)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level18 level34)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level18 level35)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level18 level36)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level18 level37)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level18 level38)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level18 level39)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level18 level40)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level18 level41)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level18 level42)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level18 level43)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level18 level44)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level18 level45)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level18 level46)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level18 level47)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level18 level48)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level18 level49)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level18 level50)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level18 level51)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level18 level52)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level18 level53)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level18 level54)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level18 level55)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level18 level56)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level18 level57)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level18 level58)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level18 level59)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level18 level60)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level18 level61)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level18 level62)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level18 level63)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level18 level64)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level18 level65)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level18 level66)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level18 level67)
(sum level49 level20 level69)
(sum level49 level22 level71)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level18 level68)
(sum level50 level20 level70)
(sum level50 level22 level72)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level18 level69)
(sum level51 level20 level71)
(sum level51 level22 level73)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level18 level70)
(sum level52 level20 level72)
(sum level52 level22 level74)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level18 level71)
(sum level53 level20 level73)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level18 level72)
(sum level54 level20 level74)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level18 level73)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level18 level74)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level65 level7 level72)
(sum level65 level8 level73)
(sum level66 level7 level73)
(sum level66 level8 level74)
(sum level67 level7 level74)

(connected l0 l1)
(fuelcost level18 l0 l1)
(connected l0 l2)
(fuelcost level20 l0 l2)
(connected l0 l3)
(fuelcost level20 l0 l3)
(connected l1 l0)
(fuelcost level18 l1 l0)
(connected l1 l2)
(fuelcost level8 l1 l2)
(connected l1 l3)
(fuelcost level22 l1 l3)
(connected l2 l0)
(fuelcost level20 l2 l0)
(connected l2 l1)
(fuelcost level8 l2 l1)
(connected l2 l3)
(fuelcost level7 l2 l3)
(connected l3 l0)
(fuelcost level20 l3 l0)
(connected l3 l1)
(fuelcost level22 l3 l1)
(connected l3 l2)
(fuelcost level7 l3 l2)

(at t0 l1)
(fuel t0 level74)
(= (total-cost) 0)

(at p0 l3)
(at p1 l1)
(at p2 l0)
(at p3 l2)
(at p4 l3)
(at p5 l0)
(at p6 l2)
(at p7 l2)
(at p8 l2)
(at p9 l2)
(at p10 l0)
(at p11 l1)
(at p12 l3)
(at p13 l3)
(at p14 l3)
(at p15 l0)
(at p16 l3)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l1)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l1)
(at p7 l0)
(at p8 l0)
(at p9 l3)
(at p10 l3)
(at p11 l3)
(at p12 l2)
(at p13 l1)
(at p14 l1)
(at p15 l1)
(at p16 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 0 of 17
2. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 17
3. (drive t0 l1 l2 level66 level8 level74)
   deleted: (at t0 l1) (fuel t0 level74)
   added: (at t0 l2) (fuel t0 level66)
   goals met: 0 of 17
4. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 17
5. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 0 of 17
6. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 0 of 17
7. (drive t0 l2 l3 level59 level7 level66)
   deleted: (at t0 l2) (fuel t0 level66)
   added: (at t0 l3) (fuel t0 level59)
   goals met: 0 of 17
8. (load p16 t0 l3)
   deleted: (at p16 l3)
   added: (in p16 t0)
   goals met: 0 of 17
9. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 17
10. (drive t0 l3 l0 level39 level20 level59)
   deleted: (at t0 l3) (fuel t0 level59)
   added: (at t0 l0) (fuel t0 level39)
   goals met: 0 of 17
11. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 17
12. (load p15 t0 l0)
   deleted: (at p15 l0)
   added: (in p15 t0)
   goals met: 0 of 17
13. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 17
14. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 17
15. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 1 of 17
16. (unload p16 t0 l0)
   deleted: (in p16 t0)
   added: (at p16 l0)
   goals met: 2 of 17
17. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 3 of 17
18. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 4 of 17
19. (drive t0 l0 l3 level19 level20 level39)
   deleted: (at t0 l0) (fuel t0 level39)
   added: (at t0 l3) (fuel t0 level19)
   goals met: 4 of 17
20. (load p12 t0 l3)
   deleted: (at p12 l3)
   added: (in p12 t0)
   goals met: 4 of 17
21. (load p13 t0 l3)
   deleted: (at p13 l3)
   added: (in p13 t0)
   goals met: 4 of 17
22. (load p14 t0 l3)
   deleted: (at p14 l3)
   added: (in p14 t0)
   goals met: 4 of 17
23. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 4 of 17
24. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 5 of 17
25. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 6 of 17
26. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 7 of 17
27. (drive t0 l3 l2 level12 level7 level19)
   deleted: (at t0 l3) (fuel t0 level19)
   added: (at t0 l2) (fuel t0 level12)
   goals met: 7 of 17
28. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 7 of 17
29. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 7 of 17
30. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 8 of 17
31. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 9 of 17
32. (drive t0 l2 l1 level4 level8 level12)
   deleted: (at t0 l2) (fuel t0 level12)
   added: (at t0 l1) (fuel t0 level4)
   goals met: 9 of 17
33. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 10 of 17
34. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 11 of 17
35. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 12 of 17
36. (unload p15 t0 l1)
   deleted: (in p15 t0)
   added: (at p15 l1)
   goals met: 13 of 17
37. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 14 of 17
38. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 15 of 17
39. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 16 of 17
40. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 17 of 17
